from unittest import TestCase

import லஸ்ஸி as ல
import லஸ்ஸியிலக்கணங்கள் as இ


class இலக்கணம்_சோதனை(TestCase):
    def test_மூல்_இலக்கணம்(தன்):
        for நிரல்மொழி in இ.நிரல்மொழிகள்.நிரல்மொழிகள்:
            பகுப்பாய்விகள் = {}
            மொழி = இ.நிரல்மொழிகள்.தகவல்(நிரல்மொழி, 'மொழி')
            for சோதனை, உரை in இ.நிரல்மொழிகள்.சோதனைகள்(நிரல்மொழி).items():
                with தன்.subTest(நிரல்மொழி=நிரல்மொழி, சோதனை=சோதனை):
                    if நிரல்மொழி not in பகுப்பாய்விகள்:
                        பகுப்பாய்விகள்[நிரல்மொழி] = ல.பகுப்பாய்வி.பகுப்பாய்வி_பெறு(நிரல்மொழி, மொழி)
                    பகுப்பாய்வி = பகுப்பாய்விகள்[நிரல்மொழி]
                    பகுப்பாய்வி.parse(உரை)



இ.இலக்கணம்_பெறு('python')
இ.இலக்கணம்_பெறு('python', பதிப்பு=2)

இ.இலக்கணம்_பெறு('python', 'த')
இ.இலக்கணம்_பெறு('python', 'த', எண்ணுரு='മ')
